
List<String>  questionContents = const[
  "什么样的员工容易被提拔为管理者，他们有哪些共同特质？",
  "你用过的最让你震惊的网站有哪些？为什么？",
  "女孩子会跟一个很丑但是对你很好的男孩子谈恋爱嘛？",
  "哪些顺口溜可以帮助记忆英语单词？",
  "好用到爆的母婴用品有哪些？",
  "高三最后一百多天怎样提高学习效率？",
  "学生党怎么赚钱？"
];

List<String> usernames = const[
  "万宝盛华集团",
  "位移",
  "梦妮",
  "插刀教教主",
  "巧素",
  "树林同学",
  "沈忘"
];

List<String> answerContents = const[
  "容易被提拔为管理者的人，从底层逻辑上来说，思考力和他们的吸引力往往很容易在人群中被识别出，也就更容易被提拔为管理者。",
  "很多时候，当接到领导布置做市场调查的任务时，除了心跳加快，四肢紧张，估计剩下的就是束手无策了，头脑一片空白地开始在各大渠道进行疯狂搜索",
  "我想起了一个朋友之前说没办法跟那个女生呆在一起是因为很难想象跟她睡在一起，如果这个都很难受，女生即便对他再好，他也接受不了。。",
  "山里有只snake(蛇) 不知什么sake(缘由) 一天突然wake(苏醒) 赶快爬出lake(湖水) 口里咬着cake(蛋糕) 尾巴不停quake(发抖) 农夫抛下rake(耙子) 杀死剥皮bake(烤) 这是一个mistake(错误)",
  "看很多妈妈都买了专门的蒸汽消毒柜、暖奶器啥的，我就比较糙了，一个养生壶搞定，上面也有消毒、温奶、热奶、泡奶之类的功能。不过这都不是重点。前几天养生壶体不小心被打碎了，再买一个又要将近两百块，我就上网几十块钱买了个壶体，让它重新焕发了生机。想起以前因为壶打碎了就把养生壶扔了，我流下了悔恨的泪水。",
  "作文推荐资料 南方周末。上面有很多文章，主题是红专正，但它写的很现实和抒情，文采还很好，尤其是那种新年致辞，背下三篇套着用作文提升一个档次。还有三毛的一篇散文叫《不负我心》，我也时经常使用，可以到百度上搜。",
  "当初代写就抱着好奇心去试试，没想到这一试不可收拾，从最开始的一个月挣了900到现在的月入过万，不容易啊，真是不容易，曾经经常熬夜熬到头皮发麻，没办法，我个人觉得自己已经成年，不能够再向父母要钱，自己要经济独立，每次他们问我累吗？",
];

List<String> headUrls =const[
  "images/avatar1.jpg",
  "images/avatar2.jpg",
  "images/avatar3.jpg",
  "images/avatar4.jpg",
  "images/avatar5.jpg",
  "images/avatar6.jpg",
  "images/avatar7.jpg",
];

List<String> supportsnum = const["1000","2001","1997","2019","300","4009","4563"];

List<String> commentsnum = const["50","200","30","34","55","66","286"];


List<String> ideaContents = const[
  "大连的天气特别秀，快要春天了还下雪,我也是醉了",
  "不敢看银行账户余额数字的是成年人，不敢看成绩单数字的是学生，两个都不敢看的是大学生。",
  "有些话，只说给懂的人听，比如英语听力考试。",
  "高中早恋，被班主任叫到办公室各种批评教育规劝，我淡定的说我们是真爱，转身走了。昨天带老婆孩子逛街碰到了当年的班主任，激动的打招呼。班主任瞅了瞅我媳妇，说：你的真爱呢？转身走了。",
  "大学时不喜欢读书，跟上铺的哥们说，我最羡慕那些徒步旅行的驴友，想去那里就去那，真想来一次说走就走的徒步旅行，只可惜自己没钱买装备。上铺那哥们表示，他可以友情赞助我装备。然后，送给我一个碗。。。",
  "一个高中理科生，受韩寒、郭敬明等人的启发，放弃理科，决心靠写小说致富。第一部小说写了三章之后被父母发现，被迫中止。哦，对了，这部小说叫《霸道寝室长爱上我》。",
  "临毕业，一女生在食堂门口卖书并大字写到：买书送学姐啦。一学弟假装翻书顺便问到：买书真的可以送学姐吗？学姐回答：是的，明晚8点火车，记得来送学姐啊！",
  "同学手机掉地上了，其中夹杂着兜里的几个硬币。。。旁边一路人看到后说：哎呦，看人家，连电话费都摔出来了。。。",
];

List<String> ideaHeadUrl = const[
  "images/userimage.jpg",
  "images/skytiger.png",
  "images/mosthandsome.png",
  "images/duanyou.png",
  "images/skytiger.png",
  "images/duanyou.png",
  "images/beatifulgirl.png",
  "images/duanyou.png",
];

List<String> ideaUserName = const[
  "FreeLife",
  "大学一哥",
  "老帅",
  "段友出征",
  "大学一哥",
  "段友出征",
  "老美",
  "段友出征",
];

List<int> ideaPraisesNum = const[5,7,8,9,12,4,5,23,];
List<int> ideaCommentsNum = const[2,1,3,3,2,3,1,1];


List<String> commentContents = const[
  "Good job",
  "干的漂亮",
  "二营长，老子的意大利炮呢",
  "校医务室啥时候能添副好的拐"
];