import 'post.dart';
List<String>  postTitleList = const [
  "男生如何在恋爱中表现的更成熟可靠？",
  "如何理解「中国是发达国家的粉碎机」这一说法？",
  "在南方电网工作的体验是怎样的？",
  "《流浪地球》的剧情，还有吴京在片中的表演真的很差吗？",
  "有哪些典型的学生思维？",
  "考完研，你发现了考研的哪些坑?"

];

List<String> postContentList = const[
  "辩手李慕阳： 有几个男生常见的误区，在这里要说明，很实用主义。"
      " 1、少看电影电视和文学作品，真实的恋爱差别会非常大。如果一定要看，请重点看里面的男主角是",
  "宋一松：1. 中国光凭自己做不了粉碎机，粉碎机必须是中美组合。 "
      "与其说中国是发达国家粉碎机，我觉得更确切的表达是：中国和美国会合力粉碎其他所有国家。",
  "远古邪恶小人物： 南方电网所辖的五省区有那么多供电局，"
      "每个供电局又有那么多机关部门和基层单位，专业分工不同，加之地区间的差异，所谓「体验」肯定不会完全",
  "一针Z： 先看了流浪地球，再补战狼2，再看战狼1。良心建议，你要也这么看，"
      "一部比一部烂，但你要反过来，就可以看见一个男人的史诗。 战狼1充满了自恋的雄性",
  "宏桑： 1.认为要准备好了才能做。 这条误区是我自己曾经犯过的血淋淋的教训。 "
      "在我初入职场1年的时候，公司做业务改动，领导把我叫到办公室，问有一个新项目我",
  "泡泡水和小地瓜： 1.考研并不简单。 我相信选择考研的学生都想考个不错的学校，"
      "有人想弥补高考的遗憾，有的想摆脱本科的阴影，有的意识到一个好学校可以带来什"
];

List<int> postSupportNumber = const [10,20,30,40,50,80];
List<int> postCommentNumber = const [100,30,40,50,2,3];